const CITIES = {
    Taipei: "台北市",
    NewTaipei: "新北市",
    Taichung: "台中市",
    Kaohsiung: "高雄市",
};

const DISTRICTS = {
    [CITIES.Taipei]: [
        "中正區", "大同區", "中山區", "松山區", "大安區", "萬華區",
        "信義區", "士林區", "北投區", "內湖區", "南港區", "文山區"
    ],
    [CITIES.NewTaipei]: [
        "板橋區", "三重區", "中和區", "永和區", "新莊區", "新店區",
        "土城區", "蘆洲區", "樹林區", "汐止區", "鶯歌區", "三峽區",
        "淡水區", "瑞芳區", "五股區", "泰山區", "林口區", "深坑區",
        "石碇區", "坪林區", "三芝區", "石門區", "八里區", "平溪區",
        "雙溪區", "貢寮區", "金山區", "萬里區", "烏來區"
    ],
    [CITIES.Taichung]: [
        "中區", "東區", "南區", "西區", "北區", "北屯區", "西屯區", "南屯區",
        "太平區", "大里區", "霧峰區", "烏日區", "豐原區", "后里區",
        "石岡區", "東勢區", "和平區", "新社區", "潭子區", "大雅區",
        "神岡區", "大肚區", "沙鹿區", "龍井區", "梧棲區", "清水區",
        "大甲區", "外埔區", "大安區"
    ],
    [CITIES.Kaohsiung]: [
        "鹽埕區", "鼓山區", "左營區", "楠梓區", "三民區", "新興區",
        "前金區", "苓雅區", "前鎮區", "旗津區", "小港區", "鳳山區",
        "林園區", "大寮區", "大樹區", "大社區", "仁武區", "鳥松區",
        "岡山區", "橋頭區", "燕巢區", "田寮區", "阿蓮區", "路竹區",
        "湖內區", "茄萣區", "永安區", "彌陀區", "梓官區", "旗山區",
        "美濃區", "六龜區", "甲仙區", "杉林區", "內門區", "茂林區",
        "桃源區", "那瑪夏區"
    ]
};

module.exports = {
    CITIES,
    DISTRICTS
};
